src/KPSPublicV2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <KisiVeCuzdanDogrula xmlns="http://tckimlik.nvi.gov.tr/WS">
      <TCKimlikNo>₺tc</TCKimlikNo>
      <Ad>₺ad</Ad>
      <Soyad>₺soyad</Soyad>
      <SoyadYok>false</SoyadYok>
      <DogumGun>₺dogum_gun</DogumGun>
      <DogumGunYok>false</DogumGunYok>
      <DogumAy>₺dogum_ay</DogumAy>
      <DogumAyYok>false</DogumAyYok>
      <DogumYil>₺dogum_yil</DogumYil>
      <CuzdanSeri>₺cuzdan_seri</CuzdanSeri>
      <CuzdanNo>₺cuzdan_no</CuzdanNo>
    </KisiVeCuzdanDogrula>
  </soap12:Body>
</soap12:Envelope>